Show / Hide Table of Contents
Class MatReinforcement
Material reinforcement base class
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatReinforcement
MatReinforcementACI
MatReinforcementAUS
MatReinforcementCAN
MatReinforcementEc2
MatReinforcementHKG
MatReinforcementCHN
MatReinforcementIND
MatReinforcementRUS
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class MatReinforcement : Material
Properties
Improve this Doc   View Source
BarSurface
Surface of bar
Declaration
public ReinfBarSurface BarSurface { get; set; }
Property Value
 Type |  Description
 ReinfBarSurface
 Improve this Doc
 View Source